      *-----------------------COPYBOOK PURPOSE-------------------------*AUDREC       *                                                                *AUDREC       *  COPYBOOK TITLE: AUDREC.                                       *AUDREC       *  COPYBOOK TEXT:  AUDIT FILE RECORD FILE. EACH TIME A PROGRAM   *AUDREC       *                  CHANGES A MASTER FILE AN AUDIT RECORD IS      *AUDREC       *                  WRITTEN TO SHOW A CHANGE HAS BEEN MADE.       *AUDREC       *----------------------------------------------------------------*AUDREC            02  AUDIT-REC.                                               AUDREC                05  AR-CARR                       PIC X(02).             AUDREC                05  AR-TOT-CASH                   PIC 9(06).             AUDREC                05  AR-EMP                        PIC 9(05).             AUDREC       *********05  FILLER                        PIC X(4).              AUDREC                05  AR-TRANSACTION-ID             PIC X(4).              AUDREC                05  AR-NAME                       PIC X(6).              AUDREC                05  FILLER REDEFINES AR-NAME.                            AUDREC                    10  AR-TRANID                 PIC X(4).              AUDREC                    10  FILLER                    PIC X(2).              AUDREC                05  AR-ID-RECORD-NUMBER          PIC X(8).               AUDREC                05  FILLER                        PIC X.                 AUDREC                05  AR-PERIOD                     PIC 9(04).             AUDREC                05  AR-PREV-DEPL-EXT              PIC X(1).              AUDREC                05  AR-CURR-DEPL-EXT              PIC X(1).              AUDREC                05  AR-PREV-DENT-EXT              PIC X(1).              AUDREC                05  AR-CURR-DENT-EXT              PIC X(1).              AUDREC                05  FILLER                        PIC X(12).             AUDREC                05  AR-REQ-DATE                   PIC 9(06).             AUDREC       **       05  FILLER                        PIC X(03).             AUDREC                05  FILLER                        PIC X(01).             AUDREC                05  AR-MARKETING-CODE             PIC X(02).             AUDREC                    88  AR-OK-MKTS                VALUE '1' '2' '3' '4'  AUDREC                                                        '5' '6' '7' '8'  AUDREC                                                        'F' 'G' 'J' 'K'  AUDREC                                                        'L' 'M' 'N' 'P'  AUDREC                                                        'Q' 'R' 'T' 'C'. AUDREC                    88  AR-DB-MKTS                VALUE 'J' 'K' 'L' 'M'. AUDREC                05  AR-MAIL-CONTACT               PIC X.                 AUDREC                05  AR-EFFECTIVE-DATE.                                   AUDREC                    10  AR-EFF-YY                 PIC 9(02).             AUDREC                    10  AR-EFF-MM                 PIC 9(02).             AUDREC                05  AR-AGENT-STATE                PIC X(02).             AUDREC                05  AR-PREV-HLTH                  PIC X(02).             AUDREC                05  AR-CURR-HLTH                  PIC X(02).             AUDREC                05  AR-MAIL-FOLLOWUP              PIC X(1).              AUDREC                05  AR-LICENSE                    PIC X(13).             AUDREC                05  AR-BROKER                     PIC X(10).             AUDREC                05  AR-TYPE                       PIC X(01).             AUDREC                05  AR-DEPT                       PIC X(05).             AUDREC                05  FILLER                        PIC X(03).             AUDREC                05  AR-TERM                       PIC X(04).             AUDREC                05  AR-CERTS-DIST-CODE            PIC X(01).             AUDREC                05  FILLER                        PIC X(01).             AUDREC                05  AR-DATE.                                             AUDREC                    10  AR-DATE-MM                PIC 9(02).             AUDREC                        88  AR-DATE-MM-OK          VALUE  01 THRU 12.    AUDREC                    10  AR-DATE-DD                PIC 9(02).             AUDREC                        88  AR-DATE-DD-OK          VALUE  01 THRU 31.    AUDREC                    10  AR-DATE-YY                PIC 9(02).             AUDREC                05  AR-TIME                       PIC 9(06).             AUDREC                05  AR-INIT                       PIC X(03).             AUDREC                05  AR-CODE                       PIC X(02).             AUDREC                    88  AR-VALID-AUDITS            VALUE 'CA' 'CP' 'CB'  AUDREC                                                         'XX' 'CY' 'C1'  AUDREC                                                         'CM' ' C' 'CC'  AUDREC                                                         'BA' 'BU' 'BD'  AUDREC                                                         'BR' ' A' ' T'  AUDREC                                                         'CX' 'LX' 'CD'  AUDREC                                                         'LC' 'LA' 'LU'  AUDREC                                                         'CE' ' L' ' E'  AUDREC                                                         'LG' 'BC' 'RC'  AUDREC                                                         'AG' 'CO' 'XA'  AUDREC                                                         'NI' 'NC' 'XU'  AUDREC                                                         'NP' 'XD' 'SQ'  AUDREC                                                         'DA' 'DU' 'ML'  AUDREC                                                         'TU' 'TA' 'TD'  AUDREC                                                         'CC' 'CU' 'TT'  AUDREC                                                         'CV' ' V' 'FU'  AUDREC                                                         'PA' 'PD' 'PU'  AUDREC                                                         'P1' 'P2' 'P3'  AUDREC                                                         'P4' 'P5' 'P6'  AUDREC                                                         'P7' 'P8' 'P9'  AUDREC                                                         'X1' 'X2' 'X3'  AUDREC                                                         'X4' 'X5' 'X6'  AUDREC                                                         'CI' 'C2' 'CR'  AUDREC                                                         'CT' ' R' 'CN'  AUDREC                                                         'CG' 'EG'       AUDREC                                                         'C3' 'C4'       AUDREC                                                         'MA' 'MU'       AUDREC                                                         'SC' 'RD' 'RT'  AUDREC                                                         'R1' 'R2' 'R3'  AUDREC                                                         'EA' 'EU'.      AUDREC                    88  AR-CASE-AUDIT              VALUE 'CA' 'CP' 'CB'  AUDREC                                                         'CG'            AUDREC                                                         'C3' 'C4'       AUDREC                                                         'CX' 'XX' 'CY'  AUDREC                                                         'C1' 'LX' 'LG'  AUDREC                                                         'RC' 'CO' 'CV'  AUDREC                                                         'CR' 'CT' 'SC'. AUDREC                    88  AR-CASE-GENERAL-CHANGE     VALUE 'CG'.           AUDREC                    88  AR-CASE-PAID-THRU          VALUE 'CW' 'CZ'.      AUDREC                    88  AR-CASE-RENEW-AUDIT        VALUE 'CI'.           AUDREC                    88  AR-CLAIM-AUDIT             VALUE ' C' 'CC' 'CD'  AUDREC                                                         'CE' 'CM'.      AUDREC                    88  AR-EMP-AUDIT               VALUE ' A' ' T' ' E'  AUDREC                                                         'EG'            AUDREC                                                         ' V' 'AG' ' R'. AUDREC                    88  AR-EMPL-GENERAL-CHANGE     VALUE 'EG'.           AUDREC                    88  AR-BROKER-ADD              VALUE 'BA'.           AUDREC                    88  AR-BROKER-UPDATE           VALUE 'BU'.           AUDREC                    88  AR-BROKER-DELETE           VALUE 'BD'.           AUDREC                    88  AR-BROKER-AUDIT            VALUE 'BR'.           AUDREC                    88  AR-LICENSE-AUDIT           VALUE ' L' 'LC'.      AUDREC                    88  AR-LARGE-GROUP-AUDIT       VALUE 'LA' 'LU'.      AUDREC                    88  AR-BENEFIT-CHG-AUDIT       VALUE 'BC'.           AUDREC                    88  AR-ID-AUDIT                VALUE 'NI' 'NC' 'NP'  AUDREC                                                         'CN'.           AUDREC                    88  AR-XREF-AUDIT              VALUE 'XA' 'XU' 'XD'. AUDREC                    88  AR-ID-CUST-COMBINE         VALUE 'MC'.           AUDREC                    88  AR-ID-CUST-UNCOMBINE       VALUE 'UC'.           AUDREC                    88  AR-DEPENDENT-AUDIT         VALUE 'DA' 'DU'.      AUDREC                    88  AR-TURBO-AUDIT             VALUE 'TU' 'TA'       AUDREC                                                         'TD' 'TT'.      AUDREC                    88  AR-FINANCIAL-UPDATE        VALUE 'FU'.           AUDREC                    88  AR-DYNAMIC-SQL             VALUE 'SQ'.           AUDREC                    88  AR-CAM-AUDIT               VALUE 'P1' 'P2' 'P3'  AUDREC                                                         'P4' 'P5' 'P6'  AUDREC                                                         'P7' 'P8' 'P9'. AUDREC                    88  AR-CAT-MASTER-ADD          VALUE 'P1'.           AUDREC                    88  AR-CASE-MASTER-ADD         VALUE 'P2'.           AUDREC                    88  AR-CASE-BROKER-ADD         VALUE 'P3'.           AUDREC                    88  AR-CASE-COVERAGE-ADD       VALUE 'P4'.           AUDREC                    88  AR-CAT-MASTER-UPDATE       VALUE 'P5'.           AUDREC                    88  AR-CASE-MASTER-UPDATE      VALUE 'P6'.           AUDREC                    88  AR-CASE-BROKER-UPDATE      VALUE 'P7'.           AUDREC                    88  AR-CASE-COVERAGE-UPDATE    VALUE 'P8'.           AUDREC                    88  AR-CASE-BROKER-DELETE      VALUE 'P9'.           AUDREC                    88  AR-ECI-AUDIT               VALUE 'X1' 'X2' 'X3'  AUDREC                                                         'X4' 'X5' 'X6'. AUDREC                    88  AR-ECI-XREF-ADD            VALUE 'X1'.           AUDREC                    88  AR-ECI-XREF-UPDATE         VALUE 'X2'.           AUDREC                    88  AR-ECI-MATRIX-ADD          VALUE 'X3'.           AUDREC                    88  AR-ECI-MATRIX-UPDATE       VALUE 'X4'.           AUDREC                    88  AR-ECI-LOGON-ADD           VALUE 'X5'.           AUDREC                    88  AR-ECI-LOGON-UPDATE        VALUE 'X6'.           AUDREC                    88  AR-CASH-DIST-UPDATE        VALUE 'C2'.           AUDREC                    88  AR-PARM-AUDIT              VALUE 'PA' 'PD' 'PU'. AUDREC                    88  AR-PARM-ADD                VALUE 'PA'.           AUDREC                    88  AR-PARM-DELETE             VALUE 'PD'.           AUDREC                    88  AR-PARM-UPDATE             VALUE 'PU'.           AUDREC                    88  AR-CG-RATE-UPDATE          VALUE 'RT'.           AUDREC                    88  AR-EMP-ADDRESS-ADD         VALUE 'EA'.           AUDREC                    88  AR-EMP-ADDRESS-UPDATE      VALUE 'EU'.           AUDREC                    88  AR-EXCL-AUDIT              VALUE 'R1' 'R2' 'R3'. AUDREC                    88  AR-COV-HIST-AUDIT          VALUE 'HC' 'HE' 'HD'. AUDREC                    88  AR-COV-HIST-CASE-AUDIT     VALUE 'HC'.           AUDREC                    88  AR-COV-HIST-EMP-AUDIT      VALUE 'HE'.           AUDREC                    88  AR-COV-HIST-DEP-AUDIT      VALUE 'HD'.           AUDREC                    88  AR-TRIGGER-FOR-CLAIMS      VALUE 'FC'.           AUDREC                05  AR-PREV-COVERAGES.                                   AUDREC                    10  FILLER                    PIC X(01).             AUDREC                    10  AR-PREV-LIFE              PIC X(01).             AUDREC                    10  AR-PREV-MAT               PIC X(01).             AUDREC                    10  AR-PREV-DEPH              PIC X(01).             AUDREC                    10  AR-PREV-DEPL              PIC X(01).             AUDREC                    10  AR-PREV-STD               PIC X(01).             AUDREC                    10  AR-PREV-DENT              PIC X(01).             AUDREC                    10  AR-PREV-PCS               PIC X(01).             AUDREC                    10  AR-PREV-LTD               PIC X(01).             AUDREC                    10  AR-PREV-CODE10            PIC X(01).             AUDREC                    10  AR-PREV-ADD               PIC X(01).             AUDREC                    10  AR-PREV-CODE12            PIC X(01).             AUDREC                    10  AR-PREV-DEPCD             PIC X(01).             AUDREC                05  AR-CURR-COVERAGES.                                   AUDREC                    10  FILLER                    PIC X(01).             AUDREC                    10  AR-CURR-LIFE              PIC X(01).             AUDREC                    10  AR-CURR-MAT               PIC X(01).             AUDREC                    10  AR-CURR-DEPH              PIC X(01).             AUDREC                    10  AR-CURR-DEPL              PIC X(01).             AUDREC                    10  AR-CURR-STD               PIC X(01).             AUDREC                    10  AR-CURR-DENT              PIC X(01).             AUDREC                    10  AR-CURR-PCS               PIC X(01).             AUDREC                    10  AR-CURR-LTD               PIC X(01).             AUDREC                    10  AR-CURR-CODE10            PIC X(01).             AUDREC                    10  AR-CURR-ADD               PIC X(01).             AUDREC                    10  AR-CURR-CODE12            PIC X(01).             AUDREC                    10  AR-CURR-DEPCD             PIC X(01).             AUDREC                05  AR-CASE-DATE.                                        AUDREC                    10  AR-CASE-MM                PIC X(02).             AUDREC                        88  AR-CASE-MM-OK          VALUE '01' THRU '12'. AUDREC                    10  AR-CASE-DD                PIC X(02).             AUDREC                        88  AR-CASE-DD-OK          VALUE '01' THRU '31'. AUDREC                    10  AR-CASE-YY                PIC X(02).             AUDREC                05  AR-EMP-EFF-DATE.                                     AUDREC                    10  AR-EMP-MM                 PIC X(02).             AUDREC                        88  AR-EMP-MM-OK           VALUE '01' THRU '12'. AUDREC                    10  AR-EMP-DD                 PIC X(02).             AUDREC                        88  AR-EMP-DD-OK           VALUE '01' THRU '31'. AUDREC                    10  AR-EMP-YY                 PIC X(02).             AUDREC                05  AR-CASE                       PIC X(06).             AUDREC                05  AR-SITE-CODE                  PIC XX.                AUDREC                05  AR-USER-ID                    PIC X(8).              AUDREC                05  AR-REMAINDER-LENGTH           PIC S9(4) COMP.        AUDREC                05  AR-RECORDS.                                          AUDREC                    10  AR-PREV-TURBO                 PIC X(1700).       AUDREC                    10  AR-CURR-TURBO                 PIC X(1700).       AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CASE                  PIC X(766).        AUDREC                    10  AR-CURR-CASE                  PIC X(766).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-FINANCIAL             PIC X(583).        AUDREC                    10  AR-CURR-FINANCIAL             PIC X(583).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-EMPL                  PIC X(555).        AUDREC                    10  AR-CURR-EMPL                  PIC X(555).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CARR-CASE             PIC X(200).        AUDREC                    10  AR-CURR-CARR-CASE             PIC X(200).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CPOSIT                PIC X(390).        AUDREC                    10  AR-CURR-CPOSIT                PIC X(390).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CPOSIN                PIC X(600).        AUDREC                    10  AR-CURR-CPOSIN                PIC X(600).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CPOSI2                PIC X(449).        AUDREC                    10  AR-CURR-CPOSI2                PIC X(449).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-LRMASTER              PIC X(370).        AUDREC                    10  AR-CURR-LRMASTER              PIC X(370).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-ID                    PIC X(408).        AUDREC                    10  AR-CURR-ID                    PIC X(408).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-XREF                  PIC X(103).        AUDREC                    10  AR-CURR-XREF                  PIC X(103).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-BROKER                PIC X(121).        AUDREC                    10  AR-CURR-BROKER                PIC X(121).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC       *            10  AR-PREV-DPMASTER              PIC X(150).        AUDREC       *            10  AR-CURR-DPMASTER              PIC X(150).        AUDREC                    10  AR-PREV-DPMASTER              PIC X(300).        AUDREC                    10  AR-CURR-DPMASTER              PIC X(300).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-FROM-ID-RECORD            PIC X(8).           AUDREC                    10  AR-TO-ID-RECORD              PIC X(8).           AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PROJECT-NUMBER             PIC X(7).          AUDREC                    10  AR-PROJECT-DESC               PIC X(25).         AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CATMASTER             PIC X(300).        AUDREC                    10  AR-CURR-CATMASTER             PIC X(300).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CAT-CASEM             PIC X(850).        AUDREC                    10  AR-CURR-CAT-CASEM             PIC X(850).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CAT-CASEB             PIC X(60).         AUDREC                    10  AR-CURR-CAT-CASEB             PIC X(60).         AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CAM-COVER             PIC X(47).         AUDREC                    10  AR-CURR-CAM-COVER             PIC X(47).         AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-ECI-RECORD            PIC X(50).         AUDREC                    10  AR-CURR-ECI-RECORD            PIC X(50).         AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-DYNAMIC-SQL-STMT           PIC X(1000).       AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CASH-DIST-RECORD      PIC X(309).        AUDREC                    10  AR-CURR-CASH-DIST-RECORD      PIC X(309).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-PARM-RECORD           PIC X(312).        AUDREC                    10  AR-CURR-PARM-RECORD           PIC X(312).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-REQUEST               PIC X(120).        AUDREC                    10  AR-CURR-REQUEST               PIC X(120).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-LICENSE               PIC X(400).        AUDREC                    10  AR-CURR-LICENSE               PIC X(400).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-MAGIC-TEXT            PIC X(100).        AUDREC                    10  AR-CURR-MAGIC-TEXT            PIC X(100).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-REPORT-REQUEST        PIC X(69).         AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-MICRO-MAGIC-DISKS          PIC X(168).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-CG-RATE-RECORD        PIC X(040).        AUDREC                    10  AR-CURR-CG-RATE-RECORD        PIC X(040).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-EMP-ADDRESS-RECORD    PIC X(200).        AUDREC                    10  AR-CURR-EMP-ADDRESS-RECORD    PIC X(200).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-EXCL-RIDER-RECORD     PIC X(192).        AUDREC                    10  AR-CURR-EXCL-RIDER-RECORD     PIC X(192).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-VOLUME-RECORD         PIC X(131).        AUDREC                    10  AR-CURR-VOLUME-RECORD         PIC X(131).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                         AUDREC                    10  AR-PREV-COV-HIST-RECORD       PIC X(200).        AUDREC                    10  AR-CURR-COV-HIST-RECORD       PIC X(200).        AUDREC                05  FILLER REDEFINES AR-RECORDS.                                                   10  AR-PREV-AUD-TRL               PIC X(300).                                  10  AR-CURR-AUD-TRL               PIC X(300).               