       0990-WRITE-COST-JOURNAL-SECT SECTION.
       0990-WRITE-COST-JOURNAL.
           MOVE LOW-VALUES TO WS-COST-REMAINDER.
970917**** EXEC CICS ENTER TRACEID(128)
970917****                 FROM(WS-COST-ACCT-INFO)
970917****                 END-EXEC.
