                                                                        00100000
R08069 01  WS-COVREDT-INDICATOR.                                        00101001
R08069     05 WS-COVREDT-ROW-IND    PIC X(02) VALUE 'N'.                00101002
R08069        88 COVREDT-ROW-FOUND            VALUE 'Y'.                00102001
R08069        88 COVREDT-ROW-NOT-FND          VALUE 'N'.                00103001
R08069     05 WS-COV-EDIT-DATA-LEVEL PIC X(10) VALUE SPACES.            00103002
