       01  SYSBUSYI.                                                    SYSBUSY
           02 FILLER PIC X(12).                                         SYSBUSY
       01  SYSBUSYO REDEFINES SYSBUSYI.                                 SYSBUSY
           02 FILLER PIC X(12).                                         SYSBUSY
