       01  T3-COMMAREA.                                                 TU003COM
           05  T3-CARRIER        PIC X(2) VALUE SPACES.                 TU003COM
           05  T3-SCREEN-NAME    PIC X(8) VALUE SPACES.                 TU003COM
           05  T3-COMMAND-LINE   PIC X    VALUE 'N'.                    TU003COM
           05  T3-FIELD-FILE     PIC XX VALUE SPACES.                   TU003COM
           05  T3-FIELD-NUMBER   PIC 9(5) VALUE ZEROS.                  TU003COM
